tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "docker-compose"
brew "fzf"
brew "gh"
brew "lf"
brew "neovim"
brew "pure"
brew "stow"
brew "tmux"
brew "tpm"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "alacritty"
cask "brave-browser"
cask "docker"
cask "font-jetbrains-mono-nerd-font"
cask "rectangle"
cask "visual-studio-code"
