tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "mongodb/brew"
brew "python@3.11"
brew "awscli"
brew "buf"
brew "crane"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper-ecr"
brew "firebase-cli"
brew "fzf"
brew "gh"
brew "go"
brew "grpcurl"
brew "jq"
brew "lf"
brew "libpq", link: true
brew "mongosh"
brew "neovim"
brew "node@20"
brew "python@3.12"
brew "poetry"
brew "pure"
brew "qpdf"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "tpm"
brew "websocat"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "mongodb/brew/mongodb-database-tools"
cask "alacritty"
cask "brave-browser"
cask "docker"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "karabiner-elements"
cask "mattermost"
cask "mongodb-compass"
cask "mullvadvpn"
cask "pdfsam-basic"
cask "rectangle"
cask "skim"
cask "tunnelblick"
cask "visual-studio-code"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "bufbuild.vscode-buf"
vscode "chflick.firecode"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "james-yu.latex-workshop"
vscode "llam4u.nerdtree"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "msysyamamoto.vscode-fluentd"
vscode "nickfode.latex-formatter"
vscode "pachwenko.django-test-runner"
vscode "pbkit.vscode-pbkit"
vscode "plex.vscode-protolint"
vscode "redhat.vscode-yaml"
vscode "rioj7.command-variable"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "toba.vsfire"
vscode "uctakeoff.vscode-counter"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "william-voyek.vscode-nginx"
vscode "xaver.clang-format"
vscode "yzane.markdown-pdf"
vscode "zhuangtongfa.material-theme"
