tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "python@3.12"
brew "awscli"
brew "docker-compose"
brew "fzf"
brew "gh"
brew "go"
brew "grpcurl"
brew "lf"
brew "libpq", link: true
brew "neovim"
brew "poetry"
brew "pure"
brew "stow"
brew "tmux"
brew "tpm"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "alacritty"
cask "brave-browser"
cask "docker"
cask "font-jetbrains-mono-nerd-font"
cask "mattermost"
cask "pdfsam-basic"
cask "rectangle"
cask "skim"
cask "tunnelblick"
cask "visual-studio-code"
